Repository: HsynKlc36/kafeinCase
Catalog: NETDeveloperCaseStudy/NETDeveloperCaseStudy.Business/Resource.*.resx
Languages: tr_tr

source: Adding failed !
tr_tr: Ekleme başarısız !

source: Adding succeed !
tr_tr: Ekleme başarılı !

# Address_Length
source: Please enter an address field between 2 and 256 characters!
tr_tr: Lütfen adres alanını 2 ile 256 karakter arasında giriniz !

# Address_Not_Null
source: The address cannot be left empty !
tr_tr: Adres boş geçilemez !

# Address_No_Special_Chars
source: Do not use special characters other than '-', '/', and ':'
tr_tr: "- / :" dışında özel karakter kullanmayınız !

source: Already adding failed !
tr_tr: Bu veri zaten var !

# Cannot_Be_One_Of_The_Last_Three_Passwords
source: Password cannot be one of the last three passwords !
tr_tr: Şifre son 3 şifreden biri olamaz !

source: Casting is not completed !
tr_tr: Casting tamamlanamadı !

# ClientId_Do_Not_Null_Or_Empty
source: The ClientID field cannot be left empty !
tr_tr: ClientID alanı boş geçilemez !

# Client_Active_Description_Max_Length
source: Description Cannot Be More Than 256 Characters !
tr_tr: Açıklama 256 Karakterden Fazla Olamaz !

# Client_Active_Description_Min_Length
source: Description Cannot Be Less Than 2 Characters !
tr_tr: Açıklama 2 Karakterden Az Olamaz !

# Client_Active_Description_Not_Empty
source: Description Field Cannot Be Empty!
tr_tr: Açıklama Alanı Boş Geçilemez !

# Client_Active_Description_Not_Null
source: The user description field cannot be left empty !
tr_tr: Kullanıcı Açıklama alanı boş geçilemez !

# Client_Active_Id_Not_Empty
source: ID Field Cannot Be Empty !
tr_tr: ID Alanı Boş Geçilemez !

# Client_Activity_Status_Changed_Failed
source: Failed to change user activity status !
tr_tr: Kullanıcı aktivite durumu değiştirme başarısız !

# Client_Activity_Status_Has_Not_Changed
source: Client activity has not changed !
tr_tr: Kullanıcı aktivite durumu değişmedi !

# Client_Address_Length
source: Please enter the address field between 2 and 256 characters !
tr_tr: Lütfen adres alanını 2 ile 256 karakter arasında giriniz !

# Client_Address_Not_Null
source: You did not enter the address !
tr_tr: Adres alanını girmediniz !

# Client_Address_No_Special_Chars
source: Do not use special characters other than '-', '/', and ':'
tr_tr: "- / :" dışında özel karakter kullanmayınız !

source: Client already exists!
tr_tr: Kullanıcı zaten var!

# Client_Country_Code_Control
source: The country code was entered incorrectly !
tr_tr: Ülke kodu hatalı girildi !

# Client_Country_Code_Length
source: The country code can be at most 2 digits long !
tr_tr: Ülke kodu en fazla 2 haneli olabilir !

# Client_Country_Control
source: Country Code entered incorrectly !
tr_tr: Ülke hatalı girildi !

# Client_Country_Length
source: Country Code can be a maximum of 2 digits !
tr_tr: Ülke en fazla 2 haneli olabilir !

# Client_Creating_Fail
source: User creation failed !
tr_tr: Kullanıcı oluşturma başarısız !

# Client_Date_Of_Birth_Control
source: You Must Be Over 18 or Under 65 to Register !
tr_tr: Kayıt Yapmak İçin 18 Yaşından Büyük veya 65 Yaşından Küçük Olmalısınız !

# Client_Deleting_Fail
source: User deletion failed !
tr_tr: Kullanıcı silme başarısız !

# Client_Details_Found_Failed
source: User details retrieval failed !
tr_tr: Kullanıcı Detayları getirme işlemi başarısız !

# Client_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Client_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Client_FirstName_Matches
source: Your Name Must Have Only Letters!
tr_tr: Adınız Sadece Harflerden Oluşmalıdır!

# Client_FirstName_Max_Length
source: Your Name Cannot Be More Than 50 Characters !
tr_tr: Adınız 50 Karakterden Fazla Olamaz !

# Client_FirstName_Min_Length
source: Your Name Cannot Be Less Than 2 Characters !
tr_tr: Adınız 2 Karakterden Az Olamaz !

# Client_FirstName_Not_Empty
source: Name Field Cannot Be Empty !
tr_tr: Ad Alanı Boş Geçilemez !

# Client_Found_Failed
source: User search failed !
tr_tr: Kullanıcı bulma işlemi başarısız !

# Client_Has_Not_Found
source: Student not found !
tr_tr: Kullanıcı Bulunamadı !

# Client_Image_Extension
source: Please use only PNG, JPG, or JPEG file types !
tr_tr: Lütfen sadece PNG, JPG veya JPEG dosya türlerini kullanın !

# Client_Image_File_Size
source: The file size must be less than 10 MB !
tr_tr: Dosya boyutu 10 MB altında olmalıdır !

# Client_Image_Not_Empty
source: The client photo cannot be left blank !
tr_tr: Kullanıcı resmi boş bırakılamaz !

# Client_LastName_Matches
source: Surname Must Be Only Letters !
tr_tr: Soyad Sadece Harflerden Oluşmalıdır !

# Client_LastName_Max_Length
source: Surname Cannot Be More Than 50 Characters !
tr_tr: Soyad 50 Karakterden Fazla Olamaz !

# Client_LastName_Min_Length
source: Surname Cannot Be Less Than 2 Characters !
tr_tr: Soyad 2 Karakterden Az Olamaz !

# Client_LastName_Not_Empty
source: Surname Field Cannot Be Empty!
tr_tr: Soyad Alanı Boş Geçilemez !

# Client_Listed_Fail
source: User listing failed !
tr_tr: Kullanıcı listeleme başarısız !

source: Client not active !
tr_tr: Kullanıcı aktif değil !

# Client_Not_Found
source: User not found !
tr_tr: Kullanıcı bulunamadı !

# Client_Updated_Fail
source: The user update has failed!
tr_tr: Kullanıcı güncelleme başarısız !

# CurrentClient_Details_Found_Failed
source: Fetching details of the current user failed !
tr_tr: Mevcut kullanıcı detayları getirme işlemi başarısız !

# CurrentClient_Updated_Failed
source: Updating details of the current user failed !
tr_tr: Mevcut kullanıcı güncelleme başarısız !

# Date_Of_Birth_Control
source: You must be over 18 years old or under 65 years old !
tr_tr: 18 Yaşından Büyük veya 65 Yaşından Küçük Olmalısınız !

# Delete_Listed_Fail
source: Failed to list the deleted items !
tr_tr: Silinenleri listeleme başarısız !

source: Deleting failed !
tr_tr: Silme başarısız !

source: Deleting succeed !
tr_tr: Silme başarılı !

# Deleting_Successful
source: Deletion successful !
tr_tr: Silme işlemi başarılı !

# Email_Control
source: Please enter a valid email address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Email_Not_Empty
source: Email cannot be empty !
tr_tr: E-Mail boş olamaz !

# File_Could_Not_Be_Recovered
source: File couldn't be recovered !
tr_tr: Dosya kurtarılamadı !

# FirstName_Matches
source: Your name should consist of letters only !
tr_tr: Adınız Sadece Harflerden Oluşmalıdır !

# FirstName_Max_Length
source: Your name cannot exceed 50 characters !
tr_tr: Adınız 50 Karakterden Fazla Olamaz !

# FirstName_Min_Length
source: Your name must be at least 2 characters long !
tr_tr: Adınız 2 Karakterden Az Olamaz !

# FirstName_Not_Empty
source: The name field cannot be left empty !
tr_tr: Ad Alanı Boş Geçilemez !

# Found_Failed
source: Not found !
tr_tr: Bulunamadı !

source: Found Success!
tr_tr: Bulundu !

# Gender_Not_Empty
source: Gender cannot be empty !
tr_tr: Cinsiyet boş geçilemez !

# Give_Point_Success
source: Scoring is successful !
tr_tr: Puanlama işlemi başarılı !

# Group_Type_Name_Invalid
source: Please do not use special characters !
tr_tr: Lütfen özel karakter kullanmayınız !

source: IdentityIDs do not match !
tr_tr: IdentityID' ler eşleşmiyor !

source: IDs do not match !
tr_tr: ID' ler eşleşmiyor !

# Id_Do_Not_Null_Or_Empty
source: The ID field cannot be empty !
tr_tr: ID alanı boş geçilemez !

source: Incorrect operation !
tr_tr: İşlem yanlış !

# IsClient_Control
source: User role is invalid !
tr_tr: Kullanıcı rolü hatalı !

source: ItemId has not found !
tr_tr: ItemID bulunamadı !

source: Item type is not correct !
tr_tr: Öğe türü doğru değil !

# LastName_Matches
source: Your last name should only consist of letters !
tr_tr: Soyadınız Sadece Harflerden Oluşmalıdır!

# LastName_Max_Length
source: Your last name cannot exceed 50 characters !
tr_tr: Soyadınız 50 Karakterden Fazla Olamaz !

# LastName_Min_Length
source: Your last name must be at least 2 characters long !
tr_tr: Soyadınız 2 Karakterden Az Olamaz !

# LastName_Not_Empty
source: Last name field cannot be left empty !
tr_tr: Soyad Alanı Boş Geçilemez !

# Link_Format_Fail
source: The link is not in a valid format
tr_tr: Girilen link geçerli formatta değildir!

source: Listed fail !
tr_tr: Listelenemedi !

source: Listed success !
tr_tr: Listelendi !

# List_Elements_By_UserId_Failed
source: Fetching list elements with UserID failed !
tr_tr: UserID ile liste elementlerini getirme başarısız !

# List_Elements_Failed
source: Listing elements failed !
tr_tr: elementleri listeleme başarısız !

source: List has no elements !
tr_tr: Listede element mevcut değil !

# Logged_In_Client_Updated_Failed
source: Failed to update logged-in user !
tr_tr: Giriş yapmış kullanıcıyı güncelleme başarısız !

# Login_Email_Control
source: Please enter a valid e-mail address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# Login_Email_Not_Empty
source: You must enter an e-mail address !
tr_tr: Mail adresi girmelisiniz !

# Login_Password_Not_Empty
source: You must enter a password !
tr_tr: Şifre girmelisiniz !

# Logout_Successfully
source: Logout successful !
tr_tr: Çıkış başarılı !

# Non_Existent_Directory
source: File path could not be found !
tr_tr: Dosya yolu bulunamadı !

source: Old password is incorrect !
tr_tr: Eski şifreniz yanlış !

source: Passwords do not match !
tr_tr: Şifreler eşleşmiyor !

# Password_Has_Created_Failed
source: Password creation failed !
tr_tr: Şifre oluşturma başarısız !

# Password_Has_Reset_Failed
source: Password reset failed !
tr_tr: Şifre sıfırlama başarısız !

# Password_Match_Fail
source: Passwords do not match !
tr_tr: Parolalar Eşleşmiyor !

source: The password must be at least 8 characters long and contain at least one uppercase letter, one lowercase letter, and one digit !
tr_tr: Şifre en az 8 karakter uzunluğunda olmalı en az bir büyük harf, bir küçük harf ve en az bir rakam içermelidir !

# Please_Open_Your_Email_And_Click_The_Link
source: Please open your email and click on the link
tr_tr: Lütfen E-Mail' inizi açın ve linke tıklayınız

# Register_Fail
source: Registration failed !
tr_tr: Kayıt işlemi başarısız !

# Register_Success
source: Registration successful !
tr_tr: Kayıt işlemi başarılı !

# Response_Success
source: Your answer has been added successfully!
tr_tr: Yanıtınız başarıyla eklendi!

source: Same e-mail address has already used!
tr_tr: Sisteme kayıtlı bir e-mail adresi girdiniz !

source: Sent for Approval !
tr_tr: Onaya Gönderildi !

source: Token BlackList Creation Failed !
tr_tr: Token kara liste oluşturulurken hata oluştu !

source: Token created successfully !
tr_tr: Token başarıyla oluşturuldu !

source: Token creation failed !
tr_tr: Token oluşturma başarısız !

source: Update fail !
tr_tr: Güncelleme başarısız !

source: Update success !
tr_tr: Güncelleme başarılı !

source: Username or password is wrong !
tr_tr: Kullanıcı adı veya şifre hatalı !

# UserPasswords_Has_Not_Found
source: UserPasswords not found !
tr_tr: UserPasswords bulunamadı !

# UserPassword_Found_Failed
source: Failed to find user password !
tr_tr: Kullanıcı şifresi bulma başarısız !

# UserPassword_Not_Found
source: User password could not be found !
tr_tr: Kullanıcı şifresi bulunamadı !

# User_Details_View_Success
source: User information retrieval successful !
tr_tr: Kullanıcı Bilgileri Görüntüleme Başarılı !

# User_Email_Control
source: Please enter a valid email address !
tr_tr: Lütfen geçerli bir e-mail adresi giriniz !

# User_Email_Not_Empty
source: User email cannot be empty !
tr_tr: Kullanıcı e-mail' i boş geçilemez !

source: User has not found !
tr_tr: Kullanıcı bulunamadı !

# User_Roles_Failed
source: User roles not found !
tr_tr: Kullanıcı rolleri bulunamadı !

# Video_Duration_Is_Not_Valid
source: The uploaded video cannot exceed the time limit !
tr_tr: Video süresi sınırı aşamaz !

# Video_Size_Is_Not_Valid
source: You cannot exceed the uploaded video size limit !
tr_tr: Video boyutu sınırı aşamaz !
